# 초기화
skills = {'기술':{2:'장치술', 3:'화염술', 4:'물의 술', 5:'침술', 6:'숨겨두기', 7:'의상술', 8:'포승술', 9:'등반술', 10:'고문술', 11:'기계분해술', 12:'굴착술'},
          '체술':{2:'기승술', 3:'포술', 4:'수리검술', 5:'손놀림', 6:'신체조작술', 7:'보법', 8:'주법', 9:'비행술', 10:'격투술', 11:'검술', 12:'괴력'},
          '인술':{2:'생존술', 3:'잠복술', 4:'도주술', 5:'도청술', 6:'복화술', 7:'은형술', 8:'변장술', 9:'향기술', 10:'분신술', 11:'은폐술', 12:'제육감'},
          '모술':{2:'의술', 3:'독술', 4:'함정술', 5:'조사술', 6:'사기술', 7:'대인술', 8:'예능', 9:'쿠노이치의 술', 10:'괴뢰술', 11:'유언비어술', 12:'경제력'},
          '전술':{2:'병량술', 3:'짐승조련', 4:'야전술', 5:'지리', 6:'의기', 7:'용병술', 8:'기억술', 9:'견적술', 10:'암호술', 11:'전달술', 12:'인맥'},
          '요술':{2:'이형화', 3:'소환술', 4:'사령술', 5:'결계술', 6:'봉인술', 7:'언령술', 8:'환술', 9:'마안술', 10:'천리안의 술', 11:'빙의술', 12:'주술'}}

# 0번 인덱스는 갭
sheet = [
    # 특기분야 왼쪽 갭
    [0, 0, 0, 0, 0, 0, 0],
    [12, 12, 12, 12, 12, 12],
    [12, 12, 12, 12, 12, 12],
    [12, 12, 12, 12, 12, 12],
    [12, 12, 12, 12, 12, 12],
    [12, 12, 12, 12, 12, 12],
    [12, 12, 12, 12, 12, 12],
    [12, 12, 12, 12, 12, 12],
    [12, 12, 12, 12, 12, 12],
    [12, 12, 12, 12, 12, 12],
    [12, 12, 12, 12, 12, 12],
    [12, 12, 12, 12, 12, 12] ]

# 특기 결정
def setSkill(exp:str, num:int):
    # 특기를 고르면 그걸 5로 만든다
    skills[exp][num] = 5
    # 가로로 수치재분배
    # 새로로 수치재분배

def skills_view():
    print('기술\t체술\t인술\t모술\t전술\t요술')
    for i in range(2, 12):
        print(skills['기술'][i], end='\t')
        print(skills['체술'][i], end='\t')
        print(skills['인술'][i], end='\t')
        print(skills['모술'][i], end='\t')
        print(skills['전술'][i], end='\t')
        print(skills['요술'][i])


def skills_view2():
    gap = lambda x : '□' if x == 0 else '■'
    g0 = gap(sheet[0][0])
    g1 = gap(sheet[0][1])
    g2 = gap(sheet[0][2])
    g3 = gap(sheet[0][3])
    g4 = gap(sheet[0][4])
    g5 = gap(sheet[0][5])

    print(f'{g0} 기술\t\t{g1} 체술\t\t{g2} 인술\t\t'
          f'{g3} 모술\t\t{g4} 전술\t\t{g5} 요술')

    for i in range(1, 12):
        #기
        exp = '{0:<9} {1:>2}'.format((skills['기술'][i+1]), str(sheet[i][0]))
        # exp = g0 + '{0:^6} {1:>2}'.format((skills['기술'][i+1]), str(sheet[i][0]))
        exp = g0 + '{0:<10}'.format(exp)
        print(exp, end='')
        #체
        exp = g1 + '{0:^6} {1:>2}'.format((skills['체술'][i+1]), str(sheet[i][1]))
        print(exp, end='')
        #인
        exp = g2 + '{0:^6} {1:>2}'.format((skills['인술'][i+1]), str(sheet[i][2]))
        print(exp, end='')
        #모
        exp = g3 + '{0:^6} {1:>2}'.format((skills['전술'][i+1]), str(sheet[i][3]))
        print(exp, end='')
        #전
        exp = g4 + '{0:^6} {1:>2}'.format((skills['모술'][i+1]), str(sheet[i][4]))
        print(exp, end='')
        #요
        exp = g5 + '{0:^6} {1:>2}'.format((skills['요술'][i+1]), str(sheet[i][5]))
        print(exp)

def set_skill():
    print()

print('기본 특기표')
skills_view2()
